Repository: enefry/MusicFree
Catalog: Packages/MusicFreeUI/Sources/DesignSystem/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, zh_hans

# 重试导入当前目录
source: Retry importing current directory
de: Import des aktuellen Verzeichnisses erneut versuchen
es: Reintentar la importación del directorio actual
fr: Réessayer l’importation du répertoire actuel
ja: 現在のディレクトリの読み込みを再試行
zh_hans: 重试导入当前目录

# 重试试听
source: Retry audition
de: Vorschau erneut versuchen
es: Reintentar escucha
fr: Réessayer l’écoute
ja: 試聴を再試行
zh_hans: 重试试听

# 队列末尾
source: End of queue
de: Ende der Warteschlange
es: Final de la cola
fr: Fin de la file d’attente
ja: キューの末尾
zh_hans: 队列末尾

# 队列编辑已取消，未完成的更改没有保存。
source: Queue editing was canceled. Unfinished changes were not saved.
de: Die Bearbeitung der Warteschlange wurde abgebrochen. Nicht abgeschlossene Änderungen wurden nicht gespeichert.
es: Se canceló la edición de la cola. Los cambios sin terminar no se guardaron.
fr: La modification de la file d’attente a été annulée. Les changements non terminés n’ont pas été enregistrés.
ja: キューの編集をキャンセルしました。完了していない変更は保存されませんでした。
zh_hans: 队列编辑已取消，未完成的更改没有保存。

# 降序
source: Descending
de: Absteigend
es: Descendente
fr: Décroissant
ja: 降順
zh_hans: 降序

# 隐私与联网
source: Privacy and online services
de: Datenschutz und Onlinedienste
es: Privacidad y servicios en línea
fr: Confidentialité et services en ligne
ja: プライバシーとオンラインサービス
zh_hans: 隐私与联网

# 隐私与联网服务
source: Privacy and online services
de: Datenschutz und Onlinedienste
es: Privacidad y servicios en línea
fr: Confidentialité et services en ligne
ja: プライバシーとオンラインサービス
zh_hans: 隐私与联网服务

# 隐私协议
source: Privacy policy
de: Datenschutzerklärung
es: Política de privacidad
fr: Politique de confidentialité
ja: プライバシーポリシー
zh_hans: 隐私协议

# 随机播放
source: Shuffle
de: Zufällig
es: Aleatorio
fr: Aléatoire
ja: シャッフル
zh_hans: 随机播放

# 隔离文件
source: Quarantined files
de: Dateien in Quarantäne
es: Archivos en cuarentena
fr: Fichiers en quarantaine
ja: 隔離ファイル
zh_hans: 隔离文件

# 集合歌曲分页状态无效，请刷新资料库后重试。
source: The collection page state is invalid. Refresh the library and try again.
de: Der Status der Sammlungsseite ist ungültig. Aktualisieren Sie die Mediathek und versuchen Sie es erneut.
es: El estado de la página de la colección no es válido. Actualiza la biblioteca y vuelve a intentarlo.
fr: L’état de la page de collection n’est pas valide. Actualisez la bibliothèque et réessayez.
ja: コレクションのページ状態が無効です。ライブラリを更新してもう一度お試しください。
zh_hans: 集合歌曲分页状态无效，请刷新资料库后重试。

# 集合选项
source: Collection options
de: Sammlungsoptionen
es: Opciones de la colección
fr: Options de la collection
ja: コレクションのオプション
zh_hans: 集合选项

# 需要先同意应用隐私政策
source: App privacy policy must be accepted first
de: Die Datenschutzerklärung der App muss zuerst akzeptiert werden
es: Primero debes aceptar la política de privacidad de la aplicación
fr: La politique de confidentialité de l’application doit d’abord être acceptée
ja: 先にアプリのプライバシーポリシーに同意してください
zh_hans: 需要先同意应用隐私政策

# 需要先同意来源隐私协议
source: Source privacy policy must be accepted first
de: Die Datenschutzerklärung der Quelle muss zuerst akzeptiert werden
es: Primero debes aceptar la política de privacidad de la fuente
fr: La politique de confidentialité de la source doit d’abord être acceptée
ja: 先にソースのプライバシーポリシーに同意してください
zh_hans: 需要先同意来源隐私协议

# 需要先同意隐私政策
source: Privacy policy must be accepted first
de: Die Datenschutzerklärung muss zuerst akzeptiert werden
es: Primero debes aceptar la política de privacidad
fr: La politique de confidentialité doit d’abord être acceptée
ja: 先にプライバシーポリシーに同意してください
zh_hans: 需要先同意隐私政策

# 需要同意应用协议
source: The app policy must be accepted
de: Die App-Richtlinie muss akzeptiert werden
es: Debes aceptar la política de la aplicación
fr: La politique de l’application doit être acceptée
ja: アプリのポリシーへの同意が必要です
zh_hans: 需要同意应用协议

# 需要同意应用隐私协议
source: The app privacy policy must be accepted
de: Die Datenschutzerklärung der App muss akzeptiert werden
es: Debes aceptar la política de privacidad de la aplicación
fr: La politique de confidentialité de l’application doit être acceptée
ja: アプリのプライバシーポリシーへの同意が必要です
zh_hans: 需要同意应用隐私协议

# 需要同意来源协议
source: The source policy must be accepted
de: Die Richtlinie der Quelle muss akzeptiert werden
es: Debes aceptar la política de la fuente
fr: La politique de la source doit être acceptée
ja: ソースのポリシーへの同意が必要です
zh_hans: 需要同意来源协议

# 需要同意来源隐私协议
source: The source privacy policy must be accepted
de: Die Datenschutzerklärung der Quelle muss akzeptiert werden
es: Debes aceptar la política de privacidad de la fuente
fr: La politique de confidentialité de la source doit être acceptée
ja: ソースのプライバシーポリシーへの同意が必要です
zh_hans: 需要同意来源隐私协议

# 需要恢复
source: Recovery required
de: Wiederherstellung erforderlich
es: Se requiere recuperación
fr: Restauration requise
ja: 復元が必要です
zh_hans: 需要恢复

# 需要连接 Google Drive
source: Google Drive connection required
de: Google-Drive-Verbindung erforderlich
es: Se necesita conectar con Google Drive
fr: Connexion à Google Drive requise
ja: Google Driveへの接続が必要です
zh_hans: 需要连接 Google Drive

# 需要选择 Google 账号并授权应用所需的 Drive 文件访问权限。
source: Select a Google account and authorize the file access permissions the app needs for Drive.
de: Wählen Sie ein Google-Konto aus und erteilen Sie der App die erforderlichen Dateizugriffsrechte für Drive.
es: Selecciona una cuenta de Google y autoriza los permisos de acceso a archivos de Drive que necesita la aplicación.
fr: Sélectionnez un compte Google et autorisez les droits d’accès aux fichiers Drive nécessaires à l’application.
ja: Googleアカウントを選択し、アプリに必要なDriveファイルへのアクセス権を許可してください。
zh_hans: 需要选择 Google 账号并授权应用所需的 Drive 文件访问权限。

# 需要重新连接此在线源。
source: This online source needs to be connected again.
de: Diese Online-Quelle muss erneut verbunden werden.
es: Es necesario volver a conectar esta fuente en línea.
fr: Cette source en ligne doit être reconnectée.
ja: このオンラインソースに再接続する必要があります。
zh_hans: 需要重新连接此在线源。

# 静音
source: Mute
de: Stumm
es: Silenciar
fr: Couper le son
ja: ミュート
zh_hans: 静音

# 音量
source: Volume
de: Lautstärke
es: Volumen
ja: 音量
zh_hans: 音量

# 音频资源暂时不可用。
source: The audio resource is temporarily unavailable.
de: Die Audioressource ist vorübergehend nicht verfügbar.
es: El recurso de audio no está disponible temporalmente.
fr: La ressource audio est temporairement indisponible.
ja: 音声リソースを一時的に利用できません。
zh_hans: 音频资源暂时不可用。

# 预下载歌词
source: Pre-download lyrics
de: Liedtexte vorab laden
es: Predescargar letras
fr: Pré-télécharger les paroles
ja: 歌詞を先行ダウンロード
zh_hans: 预下载歌词

# 预设
source: Preset
de: Voreinstellung
es: Preajuste
fr: Préréglage
ja: プリセット
zh_hans: 预设

# 首次进入在线源时会单独弹出应用级协议；这里用于查看和撤回同意。撤回后会同时停用所有在线源。
source: The app-level policy appears separately the first time you enter Online Sources; use this page to review or revoke consent. Revoking it also disables all online sources.
de: Beim ersten Öffnen der Online-Quellen wird die Richtlinie auf App-Ebene separat angezeigt; hier können Sie die Zustimmung prüfen und widerrufen. Durch den Widerruf werden alle Online-Quellen deaktiviert.
es: La política a nivel de aplicación aparece por separado la primera vez que entras en Fuentes en línea; usa esta página para revisar o revocar el consentimiento. Al revocarlo, también se desactivan todas las fuentes en línea.
fr: La politique au niveau de l’application s’affiche séparément lors de la première ouverture des sources en ligne ; cette page permet de consulter ou révoquer le consentement. Sa révocation désactive également toutes les sources en ligne.
ja: オンラインソースを初めて開くと、アプリレベルのポリシーが個別に表示されます。ここで同意の確認や撤回を行えます。撤回すると、すべてのオンラインソースも無効になります。
zh_hans: 首次进入在线源时会单独弹出应用级协议；这里用于查看和撤回同意。撤回后会同时停用所有在线源。

# 首次进入此来源时会弹出协议；同意后才能浏览、试听或导入。
source: The policy appears the first time you enter this source; accept it before browsing, auditioning, or importing.
de: Beim ersten Öffnen dieser Quelle wird die Richtlinie angezeigt; akzeptieren Sie sie, bevor Sie durchsuchen, eine Vorschau anhören oder importieren.
es: La política aparece la primera vez que entras en esta fuente; acéptala antes de explorar, escuchar o importar.
fr: La politique s’affiche lors de la première ouverture de cette source ; acceptez-la avant de parcourir, écouter ou importer.
ja: このソースを初めて開くとポリシーが表示されます。同意してから表示、試聴、読み込みを行ってください。
zh_hans: 首次进入此来源时会弹出协议；同意后才能浏览、试听或导入。

# 验证
source: Verify
de: Bestätigen
es: Verificar
fr: Vérifier
ja: 確認
zh_hans: 验证

# 验证并继续
source: Verify and continue
de: Bestätigen und fortfahren
es: Verificar y continuar
fr: Vérifier et continuer
ja: 確認して続ける
zh_hans: 验证并继续

# 验证码
source: Verification code
de: Bestätigungscode
es: Código de verificación
fr: Code de vérification
ja: 確認コード
zh_hans: 验证码

# 验证码（如 DSM 要求）
source: Verification code (if required by DSM)
de: Bestätigungscode (falls von DSM benötigt)
es: Código de verificación (si DSM lo solicita)
fr: Code de vérification (si DSM le demande)
ja: 確認コード（DSMで必要な場合）
zh_hans: 验证码（如 DSM 要求）

# 验证码不正确或已过期，请重新输入。
source: The verification code is incorrect or expired. Enter it again.
de: Der Bestätigungscode ist falsch oder abgelaufen. Geben Sie ihn erneut ein.
es: El código de verificación es incorrecto o ha caducado. Introdúcelo de nuevo.
fr: Le code de vérification est incorrect ou expiré. Saisissez-le à nouveau.
ja: 確認コードが正しくないか、期限切れです。もう一度入力してください。
zh_hans: 验证码不正确或已过期，请重新输入。

# 验证码不正确或已过期，请重新输入后再次提交。
source: The verification code is incorrect or expired. Enter it again and resubmit.
de: Der Bestätigungscode ist falsch oder abgelaufen. Geben Sie ihn erneut ein und senden Sie ihn noch einmal.
es: El código de verificación es incorrecto o ha caducado. Introdúcelo de nuevo y vuelve a enviarlo.
fr: Le code de vérification est incorrect ou expiré. Saisissez-le à nouveau, puis envoyez-le.
ja: 確認コードが正しくないか、期限切れです。もう一度入力して再送信してください。
zh_hans: 验证码不正确或已过期，请重新输入后再次提交。

# 验证码验证失败，请检查后重试。
source: Verification failed. Check the code and try again.
de: Bestätigung fehlgeschlagen. Prüfen Sie den Code und versuchen Sie es erneut.
es: La verificación ha fallado. Comprueba el código e inténtalo de nuevo.
fr: Échec de la vérification. Vérifiez le code et réessayez.
ja: 確認に失敗しました。コードを確認して、もう一度お試しください。
zh_hans: 验证码验证失败，请检查后重试。

# 验证码默认在添加 DS Audio 页面中填写；这里用于会话过期后的重新验证。
source: The verification code is normally entered on the Add DS Audio page; use this field to reverify after the session expires.
de: Der Bestätigungscode wird normalerweise auf der Seite „DS Audio hinzufügen“ eingegeben; hier können Sie nach Ablauf der Sitzung erneut bestätigen.
es: Normalmente, el código se introduce en la página Añadir DS Audio; aquí se usa para volver a verificar después de que caduque la sesión.
fr: Le code de vérification est normalement saisi sur la page Ajouter DS Audio ; utilisez ce champ pour vérifier à nouveau après l’expiration de la session.
ja: 確認コードは通常「DS Audioを追加」ページで入力します。ここではセッション期限切れ後の再認証に使用します。
zh_hans: 验证码默认在添加 DS Audio 页面中填写；这里用于会话过期后的重新验证。

# 验证码默认显示；如果 DSM 未启用二次验证可以留空。
source: The code is shown by default; leave it blank if two-factor verification is not enabled on DSM.
de: Der Code wird standardmäßig angezeigt; lassen Sie das Feld leer, wenn die zweistufige Bestätigung auf DSM nicht aktiviert ist.
es: El código se muestra de forma predeterminada; déjalo en blanco si DSM no tiene activada la verificación en dos pasos.
fr: Le code est affiché par défaut ; laissez-le vide si la vérification en deux étapes n’est pas activée sur DSM.
ja: コードはデフォルトで表示されます。DSMで2段階認証を有効にしていない場合は空欄にしてください。
zh_hans: 验证码默认显示；如果 DSM 未启用二次验证可以留空。

# 高音
source: Treble
de: Höhen
es: Agudos
fr: Aigus
ja: 高音
zh_hans: 高音

# 默认播放速度
source: Default playback speed
de: Standard-Wiedergabegeschwindigkeit
es: Velocidad de reproducción predeterminada
fr: Vitesse de lecture par défaut
ja: デフォルトの再生速度
zh_hans: 默认播放速度

source: %@ band gain
es: Ganancia de banda %@
fr: Gain de bande %@
ja: %@バンドゲイン
zh_hans: %@频段增益

# appearance.system
source: System
es: Sistema
fr: Système
ja: システム
zh_hans: 系统

source: Google OAuth Client ID
es: ID de cliente de Google OAuth
fr: ID client OAuth Google
ja: Google OAuthクライアントID

# library.search.albumKind
source: Album
es: Álbum
ja: アルバム
zh_hans: 专辑

source: OAuth Client ID
es: ID de cliente OAuth
fr: ID client OAuth
ja: OAuthクライアントID

# 专辑 %@
source: Album %@
es: Álbum %@
ja: アルバム %@
zh_hans: 专辑 %@

# 专辑名称
source: Album name
es: Nombre del álbum
fr: Nom de l’album
ja: アルバム名
zh_hans: 专辑名称

# 专辑详情
source: Album details
es: Detalles del álbum
fr: Détails de l’album
ja: アルバムの詳細
zh_hans: 专辑详情

# 单曲
source: Single
es: Sencillo
ja: シングル
zh_hans: 单曲

# 原声带
source: Soundtrack
es: Banda sonora
fr: Bande originale
ja: サウンドトラック
zh_hans: 原声带

# 名称
source: Name
es: Nombre
fr: Nom
ja: 名前
zh_hans: 名称

# 名称 %@
source: Name %@
es: Nombre %@
fr: Nom %@
ja: 名前 %@
zh_hans: 名称 %@

# 均衡器
source: Equalizer
es: Ecualizador
fr: Égaliseur
ja: イコライザ
zh_hans: 均衡器

# 容器
source: Container
es: Contenedor
fr: Conteneur
ja: コンテナ
zh_hans: 容器

# 导入暂存
source: Import staging
es: Preparación de importación
fr: Préparation de l’importation
ja: 読み込みステージング
zh_hans: 导入暂存

# 暂停
source: Pause
es: Pausa
ja: 一時停止
zh_hans: 暂停

# 构建
source: Build
es: Compilación
ja: ビルド
zh_hans: 构建

# 柔和摇滚
source: Soft rock
es: Rock suave
ja: ソフトロック
zh_hans: 柔和摇滚

# 派对
source: Party
es: Fiesta
fr: Fête
ja: パーティー
zh_hans: 派对

# 流派
source: Genres
es: Géneros
ja: ジャンル
zh_hans: 流派

# 流派详情
source: Genre details
es: Detalles del género
fr: Détails du genre
ja: ジャンルの詳細
zh_hans: 流派详情

# 版本
source: Version
es: Versión
ja: バージョン
zh_hans: 版本

# 状态
source: Status
es: Estado
fr: État
ja: 状態
zh_hans: 状态

# 现场
source: Live
es: Directo
fr: En direct
ja: ライブ
zh_hans: 现场

# 码率
source: Bit rate
es: Tasa de bits
fr: Débit binaire
ja: ビットレート
zh_hans: 码率

# 确定
source: OK
es: Aceptar
zh_hans: 确定

# 缓存上限
source: Cache limit
es: Límite de caché
fr: Limite du cache
ja: キャッシュ上限
zh_hans: 缓存上限

# 编码
source: Codec
es: Códec
ja: コーデック
zh_hans: 编码

# 网关
source: Gateway
es: Puerta de enlace
fr: Passerelle
ja: ゲートウェイ
zh_hans: 网关

# 详细说明
source: Details
es: Detalles
fr: Détails
ja: 詳細
zh_hans: 详细说明

# 迷你播放器
source: Mini player
es: Mini reproductor
fr: Mini-lecteur
ja: ミニプレーヤー
zh_hans: 迷你播放器

source: %lld min
ja: %lld分
zh_hans: %lld 分钟

# 俱乐部
source: Club
ja: クラブ
zh_hans: 俱乐部

# 摇滚
source: Rock
ja: ロック
zh_hans: 摇滚

# 斯卡
source: Ska
ja: スカ
zh_hans: 斯卡

# 流行
source: Pop
ja: ポップ
zh_hans: 流行

# 电子
source: Techno
ja: テクノ
zh_hans: 电子

# 百度网盘
source: Baidu Netdisk
ja: 百度ネットディスク
zh_hans: 百度网盘

# 继续播放
source: Continue Playing
ja: 再生を続ける
zh_hans: 继续播放

# 舞曲
source: Dance
ja: ダンス
zh_hans: 舞曲

# 雷鬼
source: Reggae
ja: レゲエ
zh_hans: 雷鬼

# 音频
source: Audio
ja: 音声
zh_hans: 音频

# 好
source: OK
zh_hans: 好
